export const questions = [
  {
    category: "النسب والمولد",
    question: "ما اسم والد أمير المؤمنين عليه السلام؟",
    answer: "عبد مناف بن عبد المطلب"
  },
  {
    category: "النسب والمولد",
    question: "من هي والدة أمير المؤمنين عليه السلام؟",
    answer: "فاطمة بنت أسد"
  },
  {
    category: "النسب والمولد",
    question: "أين ولد الإمام علي بن أبي طالب عليه السلام؟",
    answer: "في الكعبة الشريفة بمكة المكرمة"
  },
  {
    category: "النسب والمولد",
    question: "متى ولد الإمام علي عليه السلام؟",
    answer: "يوم الجمعة في 13 رجب بعد 30 عام من عام الفيل"
  },
  {
    category: "الشهادة والوفاة",
    question: "استشهد أمير المؤمنين عليه السلام؟",
    answer: "21 من رمضان سنة 40 للهجرة"
  },
  {
    category: "الوصايا والأقوال",
    question: "من نعى نفسه بهذه الكلمات: \"اشدد حيازيمك للموت فإن الموت لاقيك، ولا تجزع من الموت إذا حل يناديك\"؟",
    answer: "الامام علي عليه السلام"
  },
  {
    category: "الشهادة والوفاة",
    question: "أين دفن الإمام علي عليه السلام بعد استشهاده؟",
    answer: "في النجف الاشرف بالعراق"
  },
  {
    category: "النسب والمولد",
    question: "ما هو الاسم الذي سمَّت فاطمة بنت أسد ولدها أمير المؤمنين به وما معناه؟",
    answer: "حيدرة ومعناه الأسد"
  },
  {
    category: "الخلافة",
    question: "كم دامت مدة خلافة أمير المؤمنين عليه السلام؟",
    answer: "خمس سنوات"
  },
  {
    category: "الأحاديث",
    question: "أكمل الحديث الشريف: أنا مدينة العلم...",
    answer: "وعلي بابها فمن أراد المدينة فليدخل من بابها"
  },
  {
    category: "الخوارج",
    question: "لماذا سمي الخوارج بهذا الاسم؟",
    answer: "لأنهم خرجوا عن أمير المؤمنين عليه السلام وشقوا عصا الجماعة"
  },
  {
    category: "المعارك",
    question: "من الذي قتله أمير المؤمنين عليه السلام يوم الخندق؟",
    answer: "عمرو بن ود العامري"
  },
  {
    category: "النسب والمولد",
    question: "كم كان عمر الامام علي عليه السلام حين بعث الرسول صلى الله عليه وآله بالنبوة؟",
    answer: "عشر سنوات"
  },
  {
    category: "الشهادة والوفاة",
    question: "من هو قاتل أمير المؤمنين عليه السلام؟",
    answer: "عبد الرحمن بن ملجم المرادي"
  },
  {
    category: "المعارك",
    question: "ما هي الخدعة التي استعملها جيش معاوية في صفين؟",
    answer: "رفعوا المصاحف فوق الرماح"
  },
  {
    category: "المعارك",
    question: "من قائد جيش أمير المؤمنين عليه السلام في معركة صفين؟",
    answer: "مالك الأشتر"
  },
  {
    category: "المعارك",
    question: "حارب الإمام علي عليه السلام جماعة فلم يبق منهم إلا عشرة رجال، ولم يَقتلوا من جيش الإمام عليه السلام إلا عشرة رجال فمن هم؟",
    answer: "أصحاب النهروان"
  },
  {
    category: "النسب والمولد",
    question: "سمّ إحدى عمَّات أمير المؤمنين؟",
    answer: "صفية بنت عبد المطلب"
  },
  {
    category: "الأشعار",
    question: "أكمل البيت التالي: عليّ الدر والذهب المصفى....",
    answer: "وباقي الناس كلهم ترابُ"
  },
  {
    category: "المعارك",
    question: "ما هي الغزوة التي لم يحضرها أمير المؤمنين عليه السلام؟",
    answer: "غزوة تبوك"
  },
  {
    category: "الأقوال",
    question: "أكمل قول علي عليه السلام: آه من قلة الزاد....",
    answer: "وبعد السفر ووحشة الطريق"
  },
  {
    category: "الخلافة",
    question: "من أوَّل من بايع علياً عليه السلام بالخلافة ثم انقلب عليه؟",
    answer: "طلحة بن عبيد الله والزبير بن العوام"
  },
  {
    category: "الفضائل",
    question: "ما هي الضربة التي قال عنها الرسول صلى الله عليه وآله أنها تعادل عمل الثقلين إلى يوم القيامة؟",
    answer: "ضربة علي يوم الخندق"
  },
  {
    category: "الخلافة",
    question: "من أرسل أمير المؤمنين عليه السلام للدفاع عن عثمان بن عفان عندما حاصره الثوار؟",
    answer: "ولداهما الحسن والحسين عليهما السلام"
  },
  {
    category: "العائلة",
    question: "من هي أم البنين؟",
    answer: "زوجة أمير المؤمنين عليه السلام وأم أبو الفضل العباس"
  },
  {
    category: "الزواج",
    question: "ما كان جواب الرسول صلى الله عليه وآله للمحتجين على قلَّة مهر ابنته الزهراء عليه السلام بعد زواجها لأمير المؤمنين عليه السلام؟",
    answer: "ما أنا زوجت عليًا لكن الله زوَّجه"
  },
  {
    category: "الزهد",
    question: "قال الإمام علي عليه السلام: \"إن إمامكم قد اكتفى من دنياه بطمريه\"، ما هو الطمر؟",
    answer: "الثوب البالي"
  },
  {
    category: "الشهادة والوفاة",
    question: "في أيّة صلاة استشهد الإمام علي عليه السلام وفي أي مسجد؟",
    answer: "في صلاة الصبح وكان في مسجد الكوفة"
  },
  {
    category: "القرآن وأهل البيت",
    question: "من هم القربى المذكورين في الآية القرآنية: \"قل لا أسئلكم عليه أجرًا إلا المودة في القربى\"؟",
    answer: "الإمام علي عليه السلام، والزهراء، والحسن، والحسين"
  },
  {
    category: "الفضائل",
    question: "لا يحبُّ علي إلا مؤمن...",
    answer: "ولا يبغضه إلا كافر"
  },
  {
    category: "بيعة الغدير",
    question: "ماذا قال المسلمون عندما بايعوا الإمام علي عليه السلام في غدير خم؟",
    answer: "بخٍ بخٍ لك يا علي لقد أصبحت مولانا ومولى كل مؤمن ومؤمنة"
  },
  {
    category: "الخلافة",
    question: "في أيّ سنة هجرية بويع أمير المؤمنين عليه السلام بالخلافة؟",
    answer: "سنة 35 هجرية"
  },
  {
    category: "الفضائل",
    question: "كم كان يحتاج باب خيبر من الرجال حتى يحرِّكوه من مكانه؟",
    answer: "عشرون رجلاً"
  },
  {
    category: "الصحابة",
    question: "من صحابة أمير المؤمنين عليه السلام:",
    answer: "عمار بن ياسر، أبو ذر، سلمان الفارسي"
  },
  {
    category: "الألقاب",
    question: "من ألقاب أمير المؤمنين عليه السلام؟",
    answer: "المرتضى، أمير المؤمنين، يعسوب الدين، باب مدينة العلم"
  },
  {
    category: "القرآن وأهل البيت",
    question: "من المقصود بالآية القرآنية: \"يا أيها النبي بلِّغ ما أنزل إليك من ربك\"؟",
    answer: "الإمام علي عليه السلام"
  }
];
